In [65]:
import pandas as pd

In [66]:
# 2 main datatypes 
series = pd.Series(["BMW", "Tpypta", "Honda"])

In [67]:
series

0       BMW
1    Tpypta
2     Honda
dtype: object

In [68]:
# series = 1-dimensional

In [69]:
colours = pd.Series(["Red", "Blue", "White"])
colours

0      Red
1     Blue
2    White
dtype: object

In [70]:
# DataFrame = 2-dimensional
car_data = pd.DataFrame({"Car make": series, "Colour": colours})
car_data

  Car make Colour
0      BMW    Red
1   Tpypta   Blue
2    Honda  White

In [71]:
# Import data
car_sales = pd.read_csv("car-sales.csv")

In [72]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [73]:
# Exporting a dataframe 
car_sales.to_csv("exported-car-sales.csv", index=False)

In [74]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Describe data

In [75]:
# Attribute - don't have parenthesis 
car_sales.dtypes

# Function - have parenthesis 
#car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [76]:
# tells our columns' name 
car_columns = car_s
ales.columns
car_columns

NameError: name 'car_s' is not defined

In [ ]:
car_sales.index

This shows that the index start from 0 and end at 10, and is 1 step difference

In [ ]:
car_sales.describe()

In [ ]:
car_sales.info()

In [ ]:
car_sales.mean()

In [ ]:
car_prices = pd.Series([3000, 1500, 111250])
car_prices.mean()

In [ ]:
car_sales.sum()

In [ ]:
car_sales["Doors"].sum()

In [ ]:
len(car_sales)

## View & select data

In [77]:
# .head() - show the top 5 rows (default value is 5)
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [82]:
# .tail() - show the bottom 3 rows (default value is 5)
car_sales.tail(3)

     Make Colour  Odometer (KM)  Doors      Price
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [83]:
# .loc & .iloc 
animals = pd.Series(["cat", "dog", "bird", "panda", "snake"], index=[0, 3, 9, 8, 3])

In [84]:
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [87]:
# .loc[] - refer to the index number 
animals.loc[3]

3      dog
3    snake
dtype: object

In [93]:
# .loc[:3] - show until index 8  
animals.loc[:8]

0      cat
3      dog
9     bird
8    panda
dtype: object

In [89]:
# .iloc - refer to the position number 
animals.iloc[3]

'panda'

In [90]:
# .iloc[:3] - show until 3th position (same like .head())
animals.iloc[:3]

0     cat
3     dog
9    bird
dtype: object

In [95]:
# show specific column 
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [97]:
car_sales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [98]:
# only want the car that is Toyota 
car_sales[car_sales["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00